google.charts.load('current', {'packages':['corechart']});
google.charts.setOnLoadCallback(drawChart);

// Draw the chart and set the chart values
function drawChart() {
  var data = google.visualization.arrayToDataTable([
  ['Name', 'Budget(Million Baht)'],
  ['A01 :  เงินเบี้ยหวัด บำเหน็จ บำนาญ', 108094],
  ['A02 :  เงินช่วยเหลือข้าราชการ ลูกจ้าง และพนักงานของรัฐ', 5200],
  ['A03 :  เงินเลื่อนเงินเดือน และเงินปรับวุฒิข้าราชการ', 9766],
  ['A04 :  เงินสำรอง เงินสมทบ และเงินชดเชยของข้าราชการ', 32142],
  ['A05 :  เงินสมทบของลูกจ้างประจำ', 765],
  ['A06 :  ค่าใช้จ่ายในการรักษาพยาบาลข้าราชการ ลูกจ้าง และพนักงานของรัฐ', 61844],
  ['A07 :  ค่าใช้จ่ายตามโครงการอันเนื่องมาจากพระราชดำริ', 2300],
  ['A08 :  ค่าใช้จ่ายเกี่ยวกับการเสด็จพระราชดำเนินและต้อนรับประมุขต่างประเทศ', 600],
  ['A09 :  ค่าใช้จ่ายการจัดงานเฉลิมพระเกียรติพระบาทสมเด็จพระเจ้าอยู่หัว เนื่องในโอกาสพระราชพิธีมหามงคลเฉลิมพระชนมพรรษา 7 รอบ 5 ธันวาคม พ.ศ. 2554', 0],
  ['A10 :  ค่าใช้จ่ายในการขับเคลื่อนยุทธศาสตร์อยู่ดีมีสุขระดับจังหวัด', 0],
  ['A11 :  ค่าใช้จ่ายในการพัฒนาหมู่บ้านและชุมชนตามแนวปรัชญาเศรษกิฐพอพียง', 0],
  ['A12 :  ค่าใช้จ่ายการปรับเงินค่าตอบแทนบุคลากรภาครัฐ', 0],
  ['A13 :  ค่าใช้จ่ายในการดำเนินการรักษาความมั่นคงระดับประเทศ', 0],
  ['A14 :  ค่าใช้จ่ายในการพัฒนาจังหวัดชายแดนภาคใต้', 0],
  ['A15 :  เงินชดเชยค่างานสิ่งก่อสร้าง', 2700],
  ['A16 :  เงินสำรองจ่ายเพื่อกรณีฉุกเฉินหรือจำเป็น', 66000],
  ['A17 :  เงินราชการลับในการรักษาความมั่นคงของประเทศ', 0],
  ['A18 :  ค่าใช้จ่ายการปรับบัญชีเงินเดือน ค่าจ้าง และค่าตอบแทนรายเดือนของบุคลากรภาครัฐ', 12800],
  ['A19 :  ค่าใช้จ่ายในการเยียวยา ฟื้นฟู และป้องกันความเสียหายจากอุทกภัยอย่างบูรณาการ', 120000],
  ['A20 :  เงินปรับเงินเดือนแรกบรรจุและเงินปรับเงินเดือนชดเชยผู้ได้รับผลกระทบของข้าราขการและเจ้าหน้าที่รัฐ', 0],
  ['A21 :  ค่าใช้จ่ายชดใช้เงินทดรองราชการเพื่อช่วยเหลือผู้ประสบภัยพิบัติกรณีฉุกเฉิน', 0],
  ['A22 :  ค่าใช้จ่ายเสริมสร้างความเข้มแข็งและก้าวหน้าของประเทศตามแนวปฎิรูป', 0],
  ['A23 :  ค่าใช้จ่ายเสริมสร้างความเข้มแข็งของเศรษฐกิจภายในประเทศ', 0],
  ['A24 :  ค่าใช้จ่ายเพิ่มศักยภาพผู้ว่างงานเพื่อสร้างมูลค่าทางเศรษฐกิจและสังคมในชุมชน', 0],
  ['A25 :  ค่าใช้จ่ายตามมาตรการช่วยเหลือค่าครองชีพบุคลากรภาครัฐ', 0]
]);

  // Optional; add a title and set the width and height of the chart
  var options = {'width':1200, 'height':500};

  // Display the chart inside the <div> element with id="piechart"
  var chart = new google.visualization.PieChart(document.getElementById('piechart'));
  chart.draw(data, options);
}